<template>
  <div class="bg-white">
    <div class="mx-auto max-w-7xl px-6 lg:px-8">
      <div class="mx-auto max-w-2xl lg:mx-0 lg:max-w-none">
        <!-- <p class="text-base font-semibold leading-7 text-indigo-600">Deploy faster</p> -->
        
        <div class="mt-10 grid max-w-xl grid-cols-1 gap-8 text-base leading-7 text-gray-700 lg:max-w-none lg:grid-cols-2">
          <div>
            <h2 class="mt-2 text-2xl font-bold tracking-tight text-gray-900 sm:text-3xl">📚Мы предлагаем широкий выбор программ обучения в <strong>Красноярскe:</strong></h2>
            <p class="mt-8">Общий курс (разговорная практика&nbsp;🗣️, грамматика&nbsp;📖, чтение&nbsp;📚);</p>
            <p class="mt-8">Подготовка к экзаменам (ОГЭ, ЕГЭ&nbsp;🎓);</p>
            <p class="mt-8">Специализированные курсы (английский для путешествий ✈️, подготовка к собеседованиям&nbsp;🧑‍💼).</p>
            <p class="mt-8">Занятия проходят как индивидуально 👤, так и в группах 👥, что позволяет выбрать наиболее удобный формат обучения. У нас также есть онлайн-курсы 🌐 для тех, кто предпочитает учиться дистанционно.</p>
            <p class="mt-8"><strong>Первое пробное занятие бесплатно! 🎉</strong> На нем определят ваш уровень владения языком 📝 и подберут оптимальную программу обучения.</p>
            <p class="mt-8">Присоединяйтесь к нам и открывайте новые горизонты 🌍 с английским и французским языками 🇬🇧🇫🇷!</p>


            <div class="mt-10 flex">
              <a href="#form" class="rounded-md bg-indigo-600 px-3.5 py-2.5 text-sm font-semibold text-white shadow-sm hover:bg-indigo-500 focus-visible:outline focus-visible:outline-2 focus-visible:outline-offset-2 focus-visible:outline-indigo-600"> 🚀 Отправить заявку</a>
            </div>
          </div>
          <div>
            <div class="hidden mx-auto max-w-7xl sm:block">
              <img  src="/logo.png" alt="" />
            </div>
          </div>
        </div>
        
      </div>
    </div>
  </div>
</template>
