<template>
  <div class="bg-white">
    <div class="mx-auto max-w-7xl divide-y divide-gray-900/10 px-6 py-24 sm:py-32 lg:px-8 lg:py-40">
      <h2 class="text-2xl font-bold leading-10 tracking-tight text-gray-900">🎉 Уникальные предложения</h2>
      <dl class="mt-10 space-y-8 divide-y divide-gray-900/10">
        <div v-for="faq in faqs" :key="faq.id" class="pt-8 lg:grid lg:grid-cols-12 lg:gap-8">
          <dt class="text-base font-semibold leading-7 text-gray-900 lg:col-span-4">{{ faq.question }}</dt>
          <dd class="mt-4 lg:col-span-7 lg:mt-0">
            <p class="text-base leading-7 text-gray-600 whitespace-pre-wrap">{{ faq.answer }}</p>
          </dd>
        </div>
      </dl>
    </div>
  </div>
</template>

<script setup>
const faqs = [
  {
    id: 1,
    question: "Специальное предложение для студентов нашей школы.",
    answer:` Мы рады предложить всем студентам нашей школы уникальную возможность экономить на услугах нашей школы.

Условия предложения:
- Прийти на пробное занятие тем, кто планирует обучение
- При оплате абонемента вы получаете скидку 5%
- Данное предложение действует только на утренние занятия (09:00 - 12:00)

Не упустите свой шанс улучшить свое знание иностранных языков по выгодной цене! Воспользуйтесь этим предложением прямо сейчас.

С уважением, языковая школа "English Time" ❤️`,
  },

  {
    id: 2,
    question: "",
    answer:`Мы рады предложить всем студентам нашей школы уникальную возможность сэкономить 15% на каждый абонемент членов вашей семьи. Приходите семьей заниматься вместе!

Условия предложения:
- Прийти на пробное занятие тем, кто планирует обучение
-  При оплате абонемента каждого из членов семьи вы получаете скидку 15% на каждый абонемент
- При себе иметь документ, подтверждающий факт родства

Не упустите свой шанс улучшить свое знание иностранных языков по выгодной цене! Воспользуйтесь этим предложением прямо сейчас.

С уважением, языковая школа "English Time" ❤️.`,
  },

  {
    id: 3,
    question: "",
    answer:`Мы рады предложить всем студентам нашей школы уникальную возможность сэкономить 20% на приобретение одной из наших услуг. 

Условия предложения:
- Пригласить друга или подругу на пробное занятие
- При оплате другом или подругой абонемента вы получаете скидку 20% на собственный абонемент 
- Ограничения: скидка применяется на месяц. При приглашении двух и более друзей - скидка переносится на следующий месяц

Не упустите свой шанс улучшить свое знание иностранных языков по выгодной цене! Воспользуйтесь этим предложением прямо сейчас.

С уважением, языковая школа "English Time" ❤️`,
  },

 
]
</script>